{"project":[
  {
    "ID":"1",
    "title":"D-Wok",
    "description":"<p>The D-Wok site was realized using WordPress platform, as the client is totally autonomous. The template was created in only one page (except for the details of the works). It is responsive so it is easily visible on every device and with every screen resolution.</p><p>Also, it is realized in html5, using both the CSS3 language and the JQuery library, implemented with functions created ad hoc. A slideshow for the images and the possibility to add a video was added to the portfolio section. The effects of transition were created using the jQuery library.</p>",
    "tasks": "<p>D-wok implements projects communication multiplatform, using all channels of communication, multimedia installations – major events – theater projects television and opera . D- wok has developed the mapping system architecture The Drop Vision, an innovative project of augmented reality applied to 3D projections.</p>",
    "skills": "<li>Wordpress</li><li>PHP</li><li>CSS</li><li>jQuery</li>",
    "link": "http://d-wok.it/",
    "image":"d-wok-torino-luigi-mattia-buffetti-web-developer.jpg",
    "url": "d-wok-torino",
    "type": "website"
  },
  {
    "ID":"2",
    "title":"Stefano Buffetti",
    "description":"<p>The decision to implement the jQuery library was made both to try to make the site more dynamic and to try to break away from the normal structure of colleagues’ websites.</p><p>All icons were created as a font so as to make them clearer and to make sure the loading of the site was not slowed down.</p><p>Moreover, the surgery in Perugia was registered with the service Google Places so that it could be found more easily.</p><p>Finally, although a proper SEO optimization to have more visibility in the search engines was not done, the site was registered on the major free medical sites and company sites.</p>",
    "tasks": "<p>Stefano Buffetti is a doctor graduated at the University of Rome and later he specialized in homeopathy and acupuncture, studying under Professor Negro.</p><p>Currently he has medical practices in Perugia, Rome, Montecosaro Vigne di Narni.</p><p>The goal of the site, in addition to giving visibility to the work of the doctor, is to make it immediately clear in which office you can get an appointment, so it was decided to dedicate a different part of the page to each different city and put the map linked to google maps for each doctor’s surgery.</p>",
    "skills": "<li>Html</li><li>CSS</li><li>jQuery</li>",
    "link": "http://stefanobuffetti-omeopata.it/",
    "image":"stefano-buffetti-omeopata-luigi-mattia-buffetti-web-developer.jpg",
    "url": "stefano-buffetti-homeopath",
    "type": "website"
  },
  {
    "ID":"3",
    "title":"Federica Borgato",
    "description":"<p>The site was designed to have two key features: to be easy to update, and responsive.</p><p>I create the template for Wordpress using as plugin to create the page the visual composer of Elegant Themes (Divi).</p>",
    "tasks": "<p>Federica Borgato is a young freelance photographer and video maker from Turin and the website is a showcase of her works.</p>",
    "skills": "<li>Wordpress</li><li>Visual Composer of Elegant Themes</li><li>PHP</li><li>CSS</li><li>jQuery</li>",
    "link": "http://www.federicaborgato.com/",
    "image":"federica-borgato-photographer-luigi-mattia-buffetti-web-developer.jpg",
    "url": "federica-borgato-photographer",
    "type": "website"
  },
  {
    "ID":"4",
    "title":"Santa Design Studio",
    "description":"<p>The site was designed to have two key features: to be easy to update, and responsive.</p><p>I create the template for Wordpress using as plugin to create the page the visual composer of WPBakery and I create some new shortocode for the composer to simplify update the pages and projects.</p>",
    "tasks": "<p>The Santa Design Studio, founded by two young designers, is active in the design of products, furniture, lighting and graphics.</p><p>The main characteristic of the site is that it is responsive, both in height and in width, so as to avoid any scrolling, lateral or horizontal, and make the site visible as a whole.</p>",
    "skills": "<li>Wordpress</li><li>Visual Composer - WPBakery</li><li>PHP</li><li>CSS</li><li>jQuery</li>",
    "link": "http://santa.design/",
    "image":"santa-design-studio-designer-luigi-mattia-buffetti-web-developer.jpg",
    "url": "santa-design-studio",
    "type": "website"
  },
  {
    "ID":"4",
    "title":"MCI Contest",
    "description":"<p>I create the login by Facebook, Twitter or Google plus, and the student can send the project using the appropriate form so that it could be reviewed and, if deemed valid, automatically added by the administrator. The site contained several pages explaining the project, what they did with the presentation of certain products and the part about the contest itself. In this section you could view a brief description of the contest, a slide of the projects involved and a list of the top 3 students.</p><p>This was accomplished directly on the page of the project by a vote, permitted only to users who had registered from 1 to 3. The ranking was updated automatically processing this data.<p></p>Grafica: Leo Leonardi</p>",
    "tasks": "<p>MCI Contest was a competition organized by Material ConneXion Italy with the support of Wired and focuses on the creative use of new materials produced in Italy. “Concepts and ideas for the application of innovative materials” was the theme of the MCI Contest (which premiered at the Wired Next Fest), and was aimed at promising, young fashion and art designers.</p><p>The webiste was submitted on Wired Italy. The purpose was to advertise the products, giving the opportunity to all young designers and architects between 18 and 45 years to join the site (those who wanted could also log in using Facebook, Twitter or Google plus), and using the appropriate form to send the project so that it could be reviewed and, if deemed valid, automatically added by the administrator</p>",
    "skills": "<li>Wordpress</li><li>PHP</li><li>CSS</li><li>jQuery</li>",
    "link": "http://www.mcicontest.it/",
    "image":"material-connection-italia-contest-luigi-mattia-buffetti-web-developer.jpg",
    "url": "mci-contest",
    "type": "website"
  },
  {
    "ID":"5",
    "title":"Ceramic Futures",
    "description":"<p>In the Diary all jobs added by users registered for the contest were collected, there was the title of the project, author’s name, votes received, visits and comments and finally a short description of the project. Going into each project, in addition to the automatic counting of the visit, you could vote for the project, comment on it, and see the slideshow of the images.</p><p>In the Community section there were all members, hovering over each student you could see some information while clicking on the name you entered their profile so that you could get more information.</p><p>The uniqueness of the site is the page for every member. Here you could find the description of the student and the links to their social networks (usually facebook, twitter and instagram), the activity on the site could be seen through the use of graphics . The first pie chart showed the data as a percentage of the interactions on the site, posted projects, comments made and received, the votes received, visits received. The second Cartesian graph was used to see the trend of the last 20 days using the same data as the first graph. The third and last chart was the same on each profile and gave a comparison of all the authors. The x-axis represents the work added and the y-axis the visits received, the size of the circle represents the votes received and the color is the number of comments made about other jobs. At the bottom the work of each author was shown.</p><p>Graphic: Leo Leonardi</p>",
    "tasks": "<p>Ceramic Futures was a design contest, online and offline, involving students from the Glasgow School of Art, IED Rome, Milan Polytechnic and Academy Abadir. The project was to create a portal for the online contest. The most important sections of the site were the Diary, Community sections, and pages for each individual student.</p>",
    "skills": "<li>Wordpress</li><li>PHP</li><li>CSS</li><li>jQuery</li>",
    "link": "http://www.ceramicfutures.com/1/",
    "image":"ceramic-futures-contenst-luigi-mattia-buffetti-web-developer.jpg",
    "url": "ceramic-futures",
    "type": "website"
  },
  {
    "ID":"6",
    "title":"PES Widget",
    "description":"<p>I realized the template in xhtml, in collaboration with Latte Creative, in compliance with the standards of the W3C, respecting the ‘triple A’ for protocol conformance level easily accessible to the blind.</p><p>It includes the following sections and tools, each of which is explained in more detail on the main page of each section:</p><p>Voting on 20 major issues, on which the members of the PES (MEP MEPs) also voted in the last five years. The voters can find out which MEP or new candidate comes closest to their views.</p><p>Widget</p><p>A widget is a mini-version of a website that can be embedded on another website. You can create a free PES widget to embed on your own website or that of your organisation or publication. This widget allows you to use the Match Your Vote tool of the website.</p><p>Graphic/Art Direction: Franz Goria</p><p>Project realized with: Latte Creative</p>",
    "tasks": "<p>PES, Party of European Socialists unites the Socialist, the Social Democratics and the Works Parties of European Union (EU).</p><p>The widget was developed  by VoteWatch Europe, which is an independent organization set up to promote better debates and greater transparency in EU decision-making, by providing easy access to, and analysis of, the votes and other activities of the European Parliament (EP) and the EU Council of Ministers (Council).</p>",
    "skills": "<li>HTML</li><li>CSS</li><li>Bootstrap</li><li>jQuery</li><li>Ajax</li><li>Bitbucket</li>",
    "link": "http://electio2014.lat.webfactional.com/pes_widget",
    "image":"pes-widget-party-of-european-socialists-unites-the-socialist-luigi-mattia-buffetti.jpg",
    "url": "pes-widget-party-of-european-socialists-unites-the-socialist",
    "type": "website"
  },
  {
    "ID":"7",
    "title":"Electio 2014",
    "description":"<p>The platform was developed by VoteWatch Europe, an independent organization set up to promote better debates and greater transparency in EU decision-making, by providing easy access to, and analysis of, the votes and other activities of the European Parliament (EP) and the EU Council of Ministers (Council).</p><p>I realized the template in xhtml, in collaboration with Latte Creative, in compliance with the standards of the W3C, respecting the ‘triple A’ for protocol conformance level easily accessible to the blind.</p><p>Graphic/Art Direction: Franz Goria</p><p>Project realized with: Latte Creative</p>",
    "tasks": "<p>Electio 2014 is a platform in 24 languages designed to help the voter to decide which candidates or parties to vote for in elections of European Parliaments 2014. “Electio” in Latin is “choice”.</p>",
    "skills": "<li>HTML</li><li>CSS</li><li>Bootsrap</li><li>jQuery</li><li>Ajax</li><li>Bitbucket</li>",
    "link": "http://www.votewatch.eu/electio/",
    "image":"electio-2014-european-parlament-bruxelles-luigi-mattia-buffetti-web-developer.jpg",
    "url": "electio-2014",
    "type": "website"
  },
  {
    "ID":"8",
    "title":"Dr. Carlo Graziani",
    "description":"<p>For the homepage the slide was realized using the plugin revslider, under it the carousel is a slide of news headings. For the sections of aestethic treatments, functional treatments, images and videos, the admin panel was modified adding the same section to each so they are easier to manage.</p><p>On the homepage I added a menu that is visible when the mouse is over the image or treatment headings. In this menu there is a list of all treatments.</p><p>For detail of the treatments, I added in the admin panel the possibility to indicate the type, area, anesthesia, surgery length, recovery time, rehabilitation time, the last three are shown by a graph to make it easier to read.</p><p>The dropdown menu “Read more” automatically shows the last 4 news items. The site is responsive and it even works on Explorer 8.</p><p>Graphic/Art Direction: Leo Leonardi</p>",
    "tasks": "<p>Dr. Graziani is an eye-facial surgeon. Oculoplastic surgery is a highly specialised branch of ophthalmology that includes the plastic, reconstructive and aesthetic treatment of eyelids, lacrimal ducts, orbit and face. Dr. Graziani keeps up to date with latest developments in the field through international surgical training.</p>",
    "skills": "<li>Wordpress</li><li>CSS</li><li>PHP</li><li>jQuery</li><li>Ajax</li>",
    "link": "https://oculoplastica.it/",
    "image":"carlo-graziani-oculoplastica-luigi-mattia-buffetti-web-developer.jpg",
    "url": "dr-carlo-graziani-oculoplastico",
    "type": "website"
  },
  {
    "ID":"9",
    "title":"Social Media Expo 2015",
    "description":"<p>I present a support to develop for different platform for Social Media. I create template for Wordpress and Tumblr, I create an ad hoc platform. Also I provide support to the trainees who make their experience at the Milan Triennale.</p><p>I developed the showcase website using Wordpress and then I created other platform to help users to know everything of Expo2015.<p>I develoed:</p><ul><li>100thingstodo</li><li>Bioparcosocialmediaday</li><li>Expogram</li><li>Expoinviaggio</li><li>Expolibris</li>moldor</li><li>Socialmediaday</li><li>Todoexpo</li><li>Template for Tumblr</li><li>Weeattogether</li><li>Workshop</li><li>Yourexpo</li></ul><p>Graphic/Art Direction: Franz Goria</p>",
    "tasks": "<p>Expo 2015 was a universal exposition hosted by Milan, Italy. It opened on May 1 at 10:00 CEST and closed on October 31.[1][2] Milan hosted an exposition for the second time; the first was the 1906 Milan International.</p><p>Social Media Team has been created thanks to a partnership between Expo Milano 2015 and La Triennale di Milano to organize, prepare and manage social communication for Expo Milano 2015 and to collaborate on social communication of XXI International Exposition “21 Century, Design after Design”(Triennale di Milano 2016).</p>",
    "skills": "<li>Wordpress</li><li>CSS</li><li>PHP</li><li>MySql</li><li>jQuery</li><li>Ajax</li>",
    "link": "http://www.socialmediaexpo2015.com/",
    "image":"social-media-expo-2015-milano-luigi-mattia-buffetti-web-developer.jpg",
    "url": "social-media-expo-2015-milano",
    "type": "website"
  },
  {
    "ID":"10",
    "title":"Art Bonus",
    "description":"<p>I developed the website in collaboration with Latte Creative. I realized the site front-end and I used the Bootstrap framework to realize the site pages and for the interventions section I used jQuery library and to load the list of interventions it makes use of ajax be- cause you can filter the results and it is saved in the cookies.</p><p>Project realized with: Latte Creative.</p>",
    "tasks": "<p>The Extraordinary Commissioner of Government for the Terzo Valico has the task of facilitating the realization of the Terzo Valico dei Giovi through action of support and support, following the progress of the work, promoting agreements between various public and private subjects. Starting in Autumn 2016, in collaboration with IdLab began addressing the Commissioner's communication, designing and developing the website, opening the Facebook page and following the Commissioner in various events and activities carried out in the area affected by the trafficking.</p>",
    "skills": "<li>HTML</li><li>CSS</li><li>Bootstrap</li><li>jQuery</li><li>Ajax</li><li>d3js</li><li>Git</li><li>Jira</li><li>Bitbucket</li>",
    "link": "http://commissarioterzovalico.mit.gov.it/",
    "image":"art-bonus-luig-mattia-buffetti-web-developer.jpg",
    "url": "art-bonus",
    "type": "website"
  },
  {
    "ID":"11",
    "title":"Commissario Terzo Valico",
    "description":"<p>I developed the website in collaboration with IdLab. The site was developed using Drupal as CMS and was hosted on MIT (Ministero dei Trasporti ed Infrastrutture - Italian Ministry of Infrastructure and Transport) server. I install a module to create the page using a visual editor to make easier to manage the content page.</p><p>For the page “L’Ambiente” I create a google map with the train lines (dashed if it is a tunnel or solid if it is a normal line) and the data is automatic from italfer REST API.<p></p>For the page “I Cantieri” I create the same map but the all data (coordinates and more info of township) is storage on json file.</p>",
    "tasks": "<p>In 2014, the Italian Ministry of Cultural Heritage and Activities and Tourism promoted Art Bonus, a Decree Law to increase private investments in art and cultural projects.</p><p>In order to inform and organize different users involved in this complex project, we designed and realized a graphic proposal that combines elements of tradition and modernity.</p>",
    "skills": "<li>Drupal</li><li>PHP</li><li>Bootstrap</li><li>jQuery</li><li>Ajax</li>",
    "link": "http://artbonus.gov.it/",
    "image":"commissario-terzo-valico-luigi-mattia-buffetti-web-developer.jpg",
    "url": "commissario-terzo-valico",
    "type": "website"
  },
  {
    "ID":"12",
    "title":"Huball",
    "description":"<p>I developed the website in collaboration with IdLab. The site was developed using Drupal as CMS and was hosted on MIT (Ministero dei Trasporti ed Infrastrutture - Italian Ministry of Infrastructure and Transport) server. I install a module to create the page using a visual editor to make easier to manage the content page.</p><p>For the page “L’Ambiente” I create a google map with the train lines (dashed if it is a tunnel or solid if it is a normal line) and the data is automatic from italfer REST API.<p></p>For the page “I Cantieri” I create the same map but the all data (coordinates and more info of township) is storage on json file.</p>",
    "tasks": "<p>Huball is an innovative hardware and software system that can monitor our lifestyle, our driving habits and out domestic environment. This allows Huball to provide insurance companies with an accurate tool to determine customized insurance premiums.</p>",
    "skills": "<li>Wordpress</li><li>Visual Composer - WPBakery</li><li>PHP</li><li>CSS</li><li>jQuery</li>",
    "link": "http://www.huball.cloud/",
    "image":"huball-luigi-mattia-buffetti-web-developer.jpg",
    "url": "huball",
    "type": "website"
  },
  {
    "ID":"13",
    "title":"TPAcademy",
    "description":"<p>The website was developed using Wordpress and I create a custom template using visual composer to make it easier the page update for the client and I modify the functions.php adding the fields to update logo and manage the footer to Customize Appearance.</p>",
    "tasks": "<p>The Producer Academy is a training school designed by The Producer International, a leader in the field of consulting for the optimization of communication implementation processes.</p><p>TPA proposes a postgraduate course on \"Media Production for Media Communication\"; the course will be held in agreement and collaboration with ALMED, Alta Scuola in Media, Communication and Entertainment of the Università Cattolica del Sacro Cuore.</p><p>TPA aims to develop skills both through a thorough theoretical preparation and total relevance to market reality through high-level expertise. Students will then have the opportunity to actively participate in the various moments that make up the thread of communication production following the various steps.</p>",
    "skills": "<li>Wordpress</li><li>Visual Composer - WPBakery</li><li>PHP</li><li>CSS</li><li>jQuery</li>",
    "link": "http://www.tpacademy.it/",
    "image":"tpa-academy-milano-luigi-mattia-buffetti-web-developer.jpg",
    "url": "tpacedemy",
    "type": "website"
  },
  {
    "ID":"14",
    "title":"Hedronics Webapp",
    "description":"<p>I developed the website in collaboration with Santa Design Studio. The site was developed using HTML, CSS, JQuery, Ajax and Bootstrap. The data of all sections are retrive with Ajax call to different Son files. We use graph, dataTable, Google maps and Full Calendar to improve the User Experience and make it easier the understanding of all sections.</p>",
    "tasks": "<p>Hedronics, the new vertical solution of Sistematica for managing drones fleets</p>In consideration of the strong growth of the drone market and the respective application fields , Sistematica SpA has chosen to offer a useful solution to manage the drones fleets.</p><p>Thanks to a twenty-year company experience in the field of software platform development for the remote monitoring of the assets distributed into a territory, Hedronics software platform comes into the market in order to satisfy the requests coming from various stakeholders such as pilots, drone fleet owner and leaser, control centers, insurance companies and equipment manufacturers.</p>",
    "skills": "<li>PHP</li><li>CSS</li><li>jQuery</li><li>Ajax</li><li>Rest API</li>",
    "link": "http://mattiabuffetti.com/Clienti/hedronics_webapp/dashboard.php",
    "image":"hedronics-webapp-luigi-mattia-buffetti-web-developer.jpg",
    "url": "hedronics-webapp",
    "type": "website"
  },
  {
    "ID":"15",
    "title":"The Cutting Board For Amatrice",
    "description":"<p>I developed the site using Wordpress and Woocommerce. The website sell only one product. The website sells only one product because part of the money earned from the sale is donated to Amatrice in order to rebuild it after the August 2016 earthquake</p><p>It's possible to pay using credit card or paypal account and it is shipped all over the world and the shipping cost is automatic calculate.</p>",
    "tasks": "<p>On August 24th, 2016 at 3:36 am, central Italy had been strucked by one most disruptive earthquakes of its history. With a magnitude of 6.0 MW, the earthquake destroyed many villages and hundreds of people have been killed.</p><p>The Cutting Board For Amatrice is not merely an object, but a longterm project to see the rebirth of Amatrice. In fact all the profits will be given to the town, for its reconstruction.</p><p>The Cutting Board For Amatrice is not merely an object, but a longterm project to see the rebirth of Amatrice. In fact all the profits will be given to the town, for its reconstruction.</p>",
    "skills": "<li>Wordpress</li><li>Woocommerce</li><li>Visual Composer Elegant Themes</li><li>PHP</li><li>CSS</li><li>jQuery</li><li>Ajax</li>",
    "link": "http://www.thecuttingboardforamatrice.com/",
    "image":"the-cutting-board-for-amatrice-luigi-mattia-buffetti-web-developer.jpg",
    "url": "the-cutting-board-for-amatrice",
    "type": "website"
  },
  {
    "ID":"16",
    "title":"Santa Agency App",
    "description":"<p>I developed the app using React Native and the download is free but the data to access it is reserved and only the client can create new client.</p>",
    "tasks":"<p>The app is for the agents of company that want send the agency presentation to possible client fill the mail input manually or selecting by own adress book.</p>",
    "skills": "<li>React Native</li>",
    "link": "https://itunes.apple.com/it/app/santa-agency/id1251634199?l=en&mt=8",
    "image":"santa-agency-app-luigi-mattia-buffetti-web-developer.jpg",
    "url": "santa-agency-app",
    "type": "app"
  },
  {
    "ID":"17",
    "title":"999 Domande Sull'Abitare",
    "description":"<p>I developed the frontend and the backend of site.<br><br>BACKEND:<br>I developed the backend using PHP and MySql to manage all content of site and I created a Json page to retrive the data dynamically.<br><br>FRONTEND:<br>I developed the Frontend using React and SCSS. I used webpack to compile project and I integrate Router to get the different pages and to change the url and React Draggable for the windows.</p>",
    "tasks":"<p>999. A collection of questions about contemporary living<br><br>Triennale of Milan<br>January 12 - April 2, 2018<br><br>A palette of Italian and International experiences that can involve the general public in an interactive and participatory way. 999 ways to live, to generate 999 questions (with 999 answers possible).</p>",
    "skills": "<li>React</li><li>PHP</li><li>Mysql</li><li>SCSS</li>",
    "link": "http://www.999domandesullabitare.org/",
    "image":"999-domande-sullo-abitare-luig-mattia-buffetti-web-developer.jpg",
    "url": "999-domande-sullo-abitare",
    "type": "website"
  }
]
}